#4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
#Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

'''Первый вариант реализации функции через оператор **'''


def my_func_var_1(x, y):
    return x ** y


print(my_func_var_1(2, 3))


#Второй варинат реализации функции с использование цикла

print('на второй вариант идей нет, к сожалению')
